Witali/yoRadio/esp8266/rtos-sdk-native/sdkconfig.defaults
CONFIG_IDF_TARGET="esp8266"
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_40M=y
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_MONITOR_BAUD=115200
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

CONFIG_ESP8266_DEFAULT_CPU_FREQ_160=y
CONFIG_FREERTOS_HZ=1000
CONFIG_ESP_MAIN_TASK_STACK_SIZE=4096
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_CONSOLE_UART_BAUDRATE=115200

CONFIG_COMPILER_OPTIMIZATION_LEVEL_RELEASE=y
CONFIG_COMPILER_OPTIMIZATION_ASSERTIONS_SILENT=y
CONFIG_COMPILER_CXX_EXCEPTIONS=n

CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_BOOTLOADER_LEVEL_WARN=y
CONFIG_ESP8266_CORE_DUMP_DISABLE=y
CONFIG_YORADIO_WEB_SEND_TIMEOUT_SECONDS=15
CONFIG_YORADIO_WIFI_RECOVERY_AP_TIMEOUT_SECONDS=30
CONFIG_YORADIO_MP3_DECODER_HELIX=y
CONFIG_YORADIO_HELIX_MP3_SSO=y
CONFIG_YORADIO_AUDIO_OUTPUT_I2S_PDM=y
CONFIG_YORADIO_SPI_PDM_OVERSAMPLE_8=y
CONFIG_YORADIO_I2S_PDM_OVERSAMPLE_32=y

CONFIG_ESP8266_WIFI_RX_BUFFER_NUM=14
CONFIG_ESP8266_WIFI_LEFT_CONTINUOUS_RX_BUFFER_NUM=14
CONFIG_ESP8266_WIFI_RX_PKT_NUM=4
CONFIG_ESP8266_WIFI_TX_PKT_NUM=4
CONFIG_LWIP_TCPIP_RECVMBOX_SIZE=12
CONFIG_LWIP_TCP_WND_DEFAULT=2440
CONFIG_LWIP_TCP_RECVMBOX_SIZE=6
CONFIG_LWIP_IPV6=n

# The target is intentionally HTTP-only. No TLS certificate bundle and no
# HTTPS OTA are linked by the application.
CONFIG_LWIP_MAX_ACTIVE_TCP=6
CONFIG_LWIP_TCP_MSL=5000
CONFIG_LWIP_TCP_MSS=536
CONFIG_LWIP_TCP_SND_BUF_DEFAULT=2440
